# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment
# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:                                       # [batch, dim(rgb, d), img_size, img_size]  m模型时dim
  # [from, repeats, module, args]                 [batch, 4(3, 1) * 1, 640, 640]            4   (3, 1)
  - [-1, 1, MSFocus, [64, 3]]  #  0-P1/2     [batch, 64(48,16) * 0.75, 320, 320]       48  (36 12)
  - [-1, 1, MSConv, [128, 3, 2]]  # 1-P2/4    [batch, 128(96,32) * 0.75, 160, 160]      96  (72 24)
  - [-1, 3, MSAAFC2f, [128, True]]  # fusion
  - [-1, 1, MSConv, [256, 3, 2]]  # 3-P3/8    [batch, 256(192,64) * 0.75, 80, 80]       192 (144 48)
  - [-1, 6, MSAAFC2f, [256, True]]
  - [-1, 1, MSConv, [512, 3, 2]]  # 5-P4/16   [batch, 512(384,128) * 0.75, 40, 40]      384 (288 96)
  - [-1, 6, MSAAFC2f, [512, True]]
  - [-1, 1, MSConv, [1024, 3, 2]]  # 7-P5/32  [batch, 768(576, 192) * 0.75, 20, 20]     576 (432, 144)
  - [-1, 3, MSAAFC2f, [1024, True]]
  - [-1, 1, MFSPPF, [1024, 5]]  # 9                 [batch, 768(576, 192) * 0.75, 20, 20]     576 (576)

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, MFConcat, [1]]  # cat backbone P4 取2/3
  - [-1, 3, MSAAFC2f_head1, [512]]  # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, MFConcat, [1]]  # cat backbone P3 取2/3
  - [-1, 3, MSAAFC2f_head2, [256]]  # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 21 (P5/32-large)

  - [[15, 18, 21], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
