# parameters
nc: 80  # number of classes
#depth_multiple: 0.33  # model depth multiple
#width_multiple: 0.50  # layer channel multiple
## anchors
#anchors:
#  - [1,3, 6,13, 9,16]  # P2/4
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32

scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C2f, [128, True]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C2f, [256, True]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 6, C2f, [512, True]],
   [-1, 1, SELayer, [512 , 16]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C2f, [1024, True]],  # 9
   [-1, 1, SELayer, [768 , 16]],
  ]

# YOLOv5 head
head:
  [
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C2f, [512, True]],  # 14

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C2f, [256, True]],  # 17

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2
   [-1, 3, C2f, [128, True]],  # 20 (P2/4-mini)

   [-1, 1, Conv, [128, 1, 2]],
   [[-1, 4], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f, [256, True]],  # 23 (P3/8-small)

   [-1, 1, Conv, [256, 1, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C2f, [512, True]],  # 26 (P4/16-medium)

   [-1, 1, Conv, [512, 1, 2]],
   [[-1, 11], 1, Concat, [1]],  # cat head P5
   [-1, 3, C2f,[1024, True]],  # 29 (P5/32-large)

   [[20, 23, 26, 29], 1, Segment, [nc, 32, 256]] ,  # Detect(P2, P3, P4, P5)
#   [[23, 26, 29, 32], 1, Segment, [nc, 32, 256]] ,  # Detect(P2, P3, P4, P5)
#   [[23, 26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P2, P3, P4, P5)
  ]
