# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8-seg instance segmentation model. For Usage examples see https://docs.ultralytics.com/tasks/segment

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-seg.yaml' will call yolov8-seg.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]           yolov8-m:      测试时1,256 训练时9,640*640
#  - [-1, 1, LSK_CPCA, [4]]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2     [4, 48, 3, 2]         128   # [9,48,320,320]
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4    [48, 96, 3, 2]
  - [-1, 3, C2f, [128, True]] # 2 c2 128    [96, 96, 2, True]     64    # [9,96,160,160]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8    [96, 192, 3, 2]
  - [-1, 6, C2f, [256, True]] # 4 c3 256    [192, 192, 4, True]   32    # [9,192,80,80]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16   [192, 384, 3, 2]
  - [-1, 6, C2f, [512, True]] # 6 c4 512    [384, 384, 4, True]   16    # [9,384,40,40]
#  - [-1, 1, LSK_CPCA, [512]]  # 0935
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32  [384, 576, 3, 2]
#  - [-1, 1, LSK_CPCA, [1024]]  # 0934
  - [-1, 3, C2f, [1024, True]]  # 8         [576, 576, 2, True]   8     # [9,576,20,20]
#  - [-1, 1, LSK_CPCA, [1024]]  # 0938
  - [-1, 1, SPPF, [1024, 5]]  # 9 c5 1024   [576, 576, 5]
#  - [-1, 1, LSK_CPCA, [1024]]  # 13 c5 1024   [1,576,8,8]  0935
# YOLOv8.0n head
head:
  - [4, 1, CBAM, [256, 7]]  # 10  # [1,192,32,32]
  - [6, 1, CBAM, [512, 7]]  # 11  # [1,384,16,16]
  - [9, 1, CBAM, [1024, 7]]   # 12 c5 1024   [1,576,8,8]  0935lsk-cpca90x0885

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12 [1,576,8->16,8->16]
#  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4  # [1,(576+384)->960,16,16]
  - [[-1, 11], 1, Concat, [1]]  # cat backbone P4  # [1,(576+384)->960,16,16]
  - [-1, 3, C2f, [512]]  # 15  # [1,960->384,16,16]

  - [-1, 1, CBAM, [512, 7]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  #  # [1,384,16->32,16->32]
#  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3  # [1,(384+576+192)->1152,32,32]
  - [[-1, 10], 1, Concat, [1]]  # cat backbone P3  # [1,(384+576+192)->1152,32,32]
  - [-1, 3, C2f, [256]]  # 18 P3  # [1,1152->192,32,32]

  - [-1, 1, CBAM, [256, 7]]  # 21
  - [-1, 1, Conv, [256, 3, 2]]  #  # [1,192,32->16,32->16]
  - [[-1, 15], 1, Concat, [1]]  #    # cat head P4  # [1,(192+384)->576,16,16]
  - [-1, 3, C2f, [512]]  # 21 P4  # [1,576->384,16,16]

#  - [-1, 1, ScConv, [512]]
  - [-1, 1, CBAM, [512, 7]]  # 24
  - [-1, 1, Conv, [512, 3, 2]]  # 2  # [1,576,16->8,16->8]
  - [[-1, 12], 1, Concat, [1]]  # 2 cat head P5  # [1,(576+384+384)->1344,8,8]
  - [-1, 3, C2f, [1024]]  # 24 P5  # [1,1344->576,8,8]

#  - [[21, 24, 28], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
#  - [[18, 21, 24], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
  - [[20, 23, 27], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
#  - [[16, 19, 22], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
#  - [[17, 20, 23], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
#  - [[16, 19, 25], 1, Segment, [nc, 32, 256]]  # Segment(P3, P4, P5)
